# 數字運算
# In[1] 乘法--------------------
x=3*6
print(x)
# In[2] 除法  1.小數除法 2.整除 3.取餘數--------
y=3/6
print(y)
z=3//6
print(z)
j=7%3
print(j)
# In[3] 次方運算------------------
x=2**3.54
print(x)
# In[4] 數字運算-------------------------
x=6
x=x+5 #x+=5
print(x)
# In[5] 字串運算-------------------------
s="Hello"+"World"
#s="Hello" "World"           #空白處等同於+ 是PYTHON的特殊用法
#s="Hello\nWorld"            #換行
#s="""Hello                  #也是換行的特殊技巧 三個雙引號內的使用 會如程式書寫被呈現出去
#          World"""
#s="Hello\nWorld"*3+"World"  #用乘法可以倍數輸出
print(s)
# In[6] 字串內的字元編號(索引)，從0開始算起----------------------
s="Hello"
print(s[1])     # e     #字元編號1
print(s[1:3])   #el     #字元編號12
print(s[1:])    #ello   #字元編號1234
print(s[:2])    #He     #字元編號01
# %%
